---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.MarkerType
source: html/c69f74c5-1157-0bc7-ce53-71dc72ad1b2c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.MarkerType Property

Type of marker.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleMarkerType MarkerType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration